Tekla Open API Reference for Tekla Structures 2025
AnalysisModelDesignProperties Class
 The AnalysisModelDesignProperties class contains information related to analysis model design properties.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisModelDesignProperties
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisModelDesignProperties
Public NotInheritable Class AnalysisModelDesignProperties
The AnalysisModelDesignProperties type exposes the following members.
Constructors
Name | Description
AnalysisModelDesignProperties
Initializes a new instance of the AnalysisModelDesignProperties class
Top
Properties
Name | Description
ConcreteDesign
 The concrete code used.
ConcreteDesignMethod
 The concrete design method.
SteelDesign
 The steel code used.
SteelDesignMethod
 The steel design method.
TimberDesign
 The timber code used.
TimberDesignMethod
 The timber design method.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace